In [60]:
# pannal data
import pandas as pd 
import numpy as np

# seris

In [19]:
labels = ['A','B', 'C','D']
list_sample = [1,2,3,4]
arr = np.array([1,2,3,4])

dict_sample = {
               'a':1, 
               'b': 2, 
               'c':3, 
               'd': 4,
               }

In [11]:
pd.Series(list_sample)

0    1
1    2
2    3
3    4
dtype: int64

In [17]:
pd.Series(dict_sample)

a    1
b    2
c    3
d    4
dtype: int64

In [18]:
pd.Series(list_sample, index= labels)

A    1
B    2
C    3
D    4
dtype: int64

In [15]:
pd.Series(data=arr, index=["Finland","Sweden","Germany", "France"])

Finland    1
Sweden     2
Germany    3
France     4
dtype: int32

# Data Frame

In [61]:
from numpy.random import randn

In [26]:
array2 = np.random.rand(4,5)
array2

array([[0.63864384, 0.21766094, 0.2864209 , 0.91915501, 0.14383176],
       [0.59548342, 0.20633388, 0.90264183, 0.42576399, 0.14965321],
       [0.8044429 , 0.44163652, 0.02642695, 0.50093236, 0.88393204],
       [0.0943613 , 0.91614613, 0.34761733, 0.31651595, 0.71793444]])

In [42]:
data = randn(5,4)
index = ["A","B","C","D","E"]
column = ["W","X","Y","Z"]

df = pd.DataFrame(data=data, index=index, columns=column)
df

          W         X         Y         Z
A  0.847037 -1.891584  0.978043  0.092980
B -0.010842 -0.734015  1.979828 -1.124234
C  1.351988  0.801467 -2.907124  1.109634
D -0.138337  0.500443  0.696238  1.104303
E -1.317500 -1.131022 -0.266018  0.028332

In [43]:
df['X']

A   -1.891584
B   -0.734015
C    0.801467
D    0.500443
E   -1.131022
Name: X, dtype: float64

In [44]:
df.W

A    0.847037
B   -0.010842
C    1.351988
D   -0.138337
E   -1.317500
Name: W, dtype: float64

# Get multiple columns, pass in a list of columns

In [45]:
df[['X',"Y"]]

          X         Y
A -1.891584  0.978043
B -0.734015  1.979828
C  0.801467 -2.907124
D  0.500443  0.696238
E -1.131022 -0.266018

In [46]:
df['T'] = [1,2,3,4,5]
df

          W         X         Y         Z  T
A  0.847037 -1.891584  0.978043  0.092980  1
B -0.010842 -0.734015  1.979828 -1.124234  2
C  1.351988  0.801467 -2.907124  1.109634  3
D -0.138337  0.500443  0.696238  1.104303  4
E -1.317500 -1.131022 -0.266018  0.028332  5

# Delete a column

In [47]:
df.drop('T', axis=1)

          W         X         Y         Z
A  0.847037 -1.891584  0.978043  0.092980
B -0.010842 -0.734015  1.979828 -1.124234
C  1.351988  0.801467 -2.907124  1.109634
D -0.138337  0.500443  0.696238  1.104303
E -1.317500 -1.131022 -0.266018  0.028332

# sellectiong Row

In [49]:
df.iloc[2]

W    1.351988
X    0.801467
Y   -2.907124
Z    1.109634
T    3.000000
Name: C, dtype: float64

In [50]:
# subset

In [51]:
df.iloc[:3,:2]

          W         X
A  0.847037 -1.891584
B -0.010842 -0.734015
C  1.351988  0.801467

In [52]:
df.loc[]

SyntaxError: invalid syntax (<ipython-input-52-1008ffe8599e>, line 1)

# Conditional Selection

In [55]:
df[df < 0]

          W         X         Y         Z   T
A       NaN -1.891584       NaN       NaN NaN
B -0.010842 -0.734015       NaN -1.124234 NaN
C       NaN       NaN -2.907124       NaN NaN
D -0.138337       NaN       NaN       NaN NaN
E -1.317500 -1.131022 -0.266018       NaN NaN

In [69]:
df[df['X']>0]

          W         X         Y         Z  T
C  1.351988  0.801467 -2.907124  1.109634  3
D -0.138337  0.500443  0.696238  1.104303  4

In [70]:
# Get subset
df[df['Y']>0][['X','Y']]

          X         Y
A -1.891584  0.978043
B -0.734015  1.979828
D  0.500443  0.696238

# missing data

In [74]:
dictionary = {
    'a': [1,2, np.nan],
    'b': [6, np.nan, np.nan],
    'c': [10,np.nan, 11],
    'd': [14,6,np.nan]
}

In [75]:
df2 = pd.DataFrame(dictionary)
df2

     a    b     c     d
0  1.0  6.0  10.0  14.0
1  2.0  NaN   NaN   6.0
2  NaN  NaN  11.0   NaN

In [76]:
df2.dropna()

     a    b     c     d
0  1.0  6.0  10.0  14.0

In [77]:
df2.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [80]:
df2.fillna(value="Filled")

        a       b       c       d
0       1       6      10      14
1       2  Filled  Filled       6
2  Filled  Filled      11  Filled

In [81]:
df2['a'].fillna(value=df2['a'].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64